Open_Foam/Simulation_Src/version_3.0+/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       25;

stopAt          endTime;

endTime         300;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type        forceCoeffs;

        functionObjectLibs ( "libforces.so" );

        outputControl   timeStep;

        log         yes;

        patches     ( cylinder );
        pName       p;
        UName       U;
        rhoName     rhoInf;     // Indicates incompressible
        log         true;
        rhoInf      1;         // Redundant for incompressible
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        CofR        (0 0 0);    // Axle midpoint on ground
        pitchAxis   (0 0 1);
        magUInf     1;
        lRef        1;          // Wheelbase length
        Aref        2.8;       // Estimated
    }

    fieldAverage1
    {
        type                fieldAverage;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        outputControl       outputTime;

        // Retrieve Cd from forceCoeffs1 object, and average using a
        // window of 50
        functionObjectName  forceCoeffs1;
        fields
        (
            Cd
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
        window              50;
    }
}

// ************************************************************************* //
