Open_Foam/Simulation_Src/version_3.0+/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       159200;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       159600;
    }
    bottom
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          300;
        startFace       159900;
    }
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          300;
        startFace       160200;
    }
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       160500;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       160800;
    }
)

// ************************************************************************* //
